; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_1 ?v8 - type_3 ?v2 - type_1)
 	      (pred_4 ?v1 - object ?v2 - type_1)
	      (pred_3 ?v8 - type_3 ?v7 - type_2)
	      (pred_2 ?v8 - type_3 ?v1 - object ?v7 - type_2))

   (:action op_2
       :parameters  (?v8 - type_3 ?v4 ?v3 - type_1)
       :precondition (and  (pred_1 ?v8 ?v4))
       :effect (and  (pred_1 ?v8 ?v3)
		     (not (pred_1 ?v8 ?v4))))

   (:action op_1
       :parameters (?v8 - type_3 ?v6 - object ?v5 - type_1 ?v7 - type_2)
       :precondition  (and  (pred_4 ?v6 ?v5) (pred_1 ?v8 ?v5) (pred_3 ?v8 ?v7))
       :effect (and (pred_2 ?v8 ?v6 ?v7)
		    (not (pred_4 ?v6 ?v5)) 
		    (not (pred_3 ?v8 ?v7))))

   (:action op_3
       :parameters (?v8 - type_3 ?v6 - object ?v5 - type_1 ?v7 - type_2)
       :precondition  (and  (pred_2 ?v8 ?v6 ?v7) (pred_1 ?v8 ?v5))
       :effect (and (pred_4 ?v6 ?v5)
		    (pred_3 ?v8 ?v7)
		    (not (pred_2 ?v8 ?v6 ?v7)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_04 - type_3
obj_08 obj_06 - type_2
obj_05 obj_09 obj_10 obj_03 - type_1
obj_01 obj_07 obj_02 - object)
(:init
(pred_1 obj_04 obj_05)
(pred_3 obj_04 obj_08)
(pred_3 obj_04 obj_06)
(pred_4 obj_01 obj_09)
(pred_4 obj_07 obj_05)
(pred_4 obj_02 obj_05)
)
(:goal
(and
(pred_4 obj_01 obj_03)
(pred_4 obj_07 obj_09)
(pred_4 obj_02 obj_09)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_04 ?b obj_08))))
)
)

; plan
1. (op_1 obj_04 obj_07 obj_05 obj_06)
   deleted: (pred_4 obj_07 obj_05) (pred_3 obj_04 obj_06)
   added: (pred_2 obj_04 obj_07 obj_06)
   goals met: 0 of 3
2. (op_2 obj_04 obj_05 obj_09)
   deleted: (pred_1 obj_04 obj_05)
   added: (pred_1 obj_04 obj_09)
   goals met: 0 of 3
3. (op_3 obj_04 obj_07 obj_09 obj_06)
   deleted: (pred_2 obj_04 obj_07 obj_06)
   added: (pred_4 obj_07 obj_09) (pred_3 obj_04 obj_06)
   goals met: 1 of 3
4. (op_1 obj_04 obj_01 obj_09 obj_06)
   deleted: (pred_4 obj_01 obj_09) (pred_3 obj_04 obj_06)
   added: (pred_2 obj_04 obj_01 obj_06)
   goals met: 1 of 3
5. (op_2 obj_04 obj_09 obj_03)
   deleted: (pred_1 obj_04 obj_09)
   added: (pred_1 obj_04 obj_03)
   goals met: 1 of 3
6. (op_3 obj_04 obj_01 obj_03 obj_06)
   deleted: (pred_2 obj_04 obj_01 obj_06)
   added: (pred_4 obj_01 obj_03) (pred_3 obj_04 obj_06)
   goals met: 2 of 3
7. (op_2 obj_04 obj_03 obj_05)
   deleted: (pred_1 obj_04 obj_03)
   added: (pred_1 obj_04 obj_05)
   goals met: 2 of 3
8. (op_1 obj_04 obj_02 obj_05 obj_06)
   deleted: (pred_4 obj_02 obj_05) (pred_3 obj_04 obj_06)
   added: (pred_2 obj_04 obj_02 obj_06)
   goals met: 2 of 3
9. (op_2 obj_04 obj_05 obj_09)
   deleted: (pred_1 obj_04 obj_05)
   added: (pred_1 obj_04 obj_09)
   goals met: 2 of 3
10. (op_3 obj_04 obj_02 obj_09 obj_06)
   deleted: (pred_2 obj_04 obj_02 obj_06)
   added: (pred_4 obj_02 obj_09) (pred_3 obj_04 obj_06)
   goals met: 3 of 3
